<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;
use App\Models\City;
use App\Models\County;
use App\Models\Town;

class SeedCitiesAndCountiesAndTownData extends Migration
{





    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        $area_datas = Array(

            '潮州市'=> [
                '湘桥区'=>['凤新街道','湘桥街道','西湖街道','金山街道','太平街道','南春街道','西新街道','桥东街道','城西街道','意溪镇','磷溪镇','官塘镇','铁铺镇'],
                '潮安区'=>['庵埠镇','文祠镇','凤凰镇','江东镇','东凤镇','龙湖镇','彩塘镇','金石镇','浮洋镇','沙溪镇','凤塘镇','古巷镇','登塘镇','赤凤镇','归湖镇','枫溪镇','万峰林场'],
                '饶平县'=>['黄冈镇','钱东镇','海山镇','大埕镇','所城镇','柘林镇','汫洲镇','樟溪镇','浮山镇','汤溪镇','三饶镇','联饶镇','新圩镇','新丰镇','饶洋镇','上饶镇','建饶镇','高堂镇','浮滨镇','新塘镇','东山镇','韩江林场']
            ],

            '揭阳市'=> [
                '榕城区'=>['新兴街道','榕华街道','中山街道','西马街道','东兴街道','榕东街道','仙桥街道','梅云街道','东升街道','东阳街道','渔湖镇','炮台镇','地都镇','登岗镇'],
                '揭东区'=>['曲溪街道','磐东街道','龙尾镇','白塔镇','霖磐镇','桂岭镇','月城镇','玉湖镇','新亨镇','锡场镇','埔田镇','云路镇','玉窖镇','东径茶场','坪上农场','揭阳高新技术产业开发区','卅岭农场','蓝城区工业园区管理处','珠海（揭阳）产业转移工业园'],
                '普宁市'=>['流沙东街道','流沙西街道','流沙南街道','流沙北街道','池尾街道','燎原街道','大南山街道','赤岗镇','大坝镇','洪阳镇','南溪镇','广太镇','麒麟镇','南径镇','占陇镇','军埠镇','下架山镇','高埔镇','云落镇','大坪镇','船埔镇','梅林镇','里湖镇'],
                '揭西县'=>['河婆街道','龙潭镇','南山镇','五经富镇','京溪园镇','灰寨镇','塔头镇','东园镇','凤江镇','棉湖镇','钱坑镇','金和镇','大溪镇','坪上镇','五云镇','上砂镇','良田乡','北山农林场','果林场','油桐林场','高田农场','县苗圃场','河輋农场','梅塘镇','后溪乡','大池农场','马鞍山农场','大坪农场','普侨区','三坑农场','乌石农场','科技工业园','英歌山工业园'],
                '惠来县'=>['惠城镇','隆江镇','葵潭镇','靖海镇','神泉镇','仙庵镇','周田镇','前詹镇','华湖镇','东陇镇','岐石镇','鳌江镇','东港镇','溪西镇','东埔农场','揭阳市大南山华侨管理区','葵潭农场','青坑林场','揭阳（惠来）沿海经济开发试验区','揭阳大南海石化工业区南海']
            ],

            '汕头市'=> [
                '龙湖区'=>['金霞街道','珠池街道','新津街道','鸥汀街道','龙祥街道','外砂镇','新溪镇'],
                '金平区'=>['石炮台街道','金砂街道','金厦街道','东方街道','大华街道','同益街道','光华街道','东墩街道','广厦街道','海安街道','新福街道','乌桥街道','岐山街道','永祥街道','鮀莲街道','鮀江街道','月浦街道'],
                '潮阳区'=>['文光街道','城南街道','棉北街道','金浦街道','海门镇','河溪镇','和平镇','西胪镇','关埠镇','金灶镇','谷饶镇','贵屿镇','铜盂镇'],
                '潮南区'=>['峡山街道','井都镇','陇田镇','雷岭镇','成田镇','红场镇','胪岗镇','两英镇','仙城镇','陈店镇','司马浦镇'],
                '澄海区'=>['凤翔街道','澄华街道','广益街道','东里镇','盐鸿镇','莲华镇','溪南镇','隆都镇','莲上镇','莲下镇','上华镇'],
                '南澳县'=>['后宅镇','云澳镇','深澳镇'],
            ],

            '汕尾市'=> [
                '城区'=>['香洲街道','新港街道','凤山街道','马宫街道','东洲街道','遮浪街道','田墘街道','捷胜镇','红草镇','东涌镇'],
                '陆丰市'=>['东海镇','城东镇','河西镇','甲子镇 ','大安镇','八万镇','陂洋镇','博美镇','南塘镇','甲东镇','湖东镇','碣石镇','金厢镇','潭西镇','桥冲镇','甲西镇','上英镇','西南镇','内湖镇','河东镇','华侨管理区','铜锣湖农场','星都经济开发试验区','大安农场','罗经嶂林场','湖东林场','东海岸林场','红岭林场','畜牧果林场'],
                '海丰县'=>['海城镇','梅陇镇','附城镇','联安镇','陶河镇','可塘镇','赤坑镇','公平镇','城东镇','黄羌镇','平东镇','鹅埠镇','赤石镇','鮜门镇','小漠镇','大湖镇','梅陇农场'],
                '陆河县'=>['河田镇','水唇镇','河口镇','新田镇','上护镇','螺溪镇','东坑镇','南万镇']
            ],

            '广州市'=> [
                '越秀区'=>['洪桥街道','北京街道','六榕街道','流花街道','光塔街道','人民街道','东山街道','农林街道','大东街道','大塘街道','珠光街道','白云街道','建设街道','华乐街道','梅花村街道','黄花岗街道','矿泉街道','登峰街道'],
                '荔湾区'=>['沙面街道','岭南街道','华林街道','多宝街道','昌华街道','逢源街道','龙津街道','金花街道','彩虹街道','南源街道','西村街道','站前街道','桥中街道','白鹤洞街道','冲口街道','花地街道','石围塘街道','茶滘街道','东漖街道','海龙街道','东沙街道','中南街道'],
                '天河区'=>['五山街道','员村街道','车陂街道','沙河街道','石牌街道','兴华街道','沙东街道','林和街道','棠下街道','猎德街道','冼村街道','天园街道','天河南街道','元岗街道','黄村街道','龙洞街道','长兴街道','凤凰街道',' 前进街道','珠吉街道','新塘'],
                '海珠区'=>['赤岗街道','新港街道','昌岗街道','江南中街道','滨江街道','素社街道','海幢街道','南华西街道','龙凤街道','沙园街道','南石头街道','凤阳街道','瑞宝街道','江海街道','琶洲街道','南洲街道','华洲街道','官洲街道'],
                '白云区'=>['三元里街道','松洲街道','景泰街道','黄石街道','同德街道','棠景街道','新市街道','同和街道','京溪街道','永平街道','均禾街道','鹤龙街道','石井街道','金沙街道','白云湖街道','石门街道','云城街道，嘉禾街道','江高镇','人和镇','太和镇','钟落潭镇'],
                '黄埔区'=>['萝岗街道','夏港街道','联和街道','东区街道','永和街道','黄埔街道','红山街道','鱼珠街道','大沙街道','文冲街道','南岗街道','荔联街道','穗东街道','长洲街道','九龙镇'],
                '花都区'=>['花城街道','新华街道','新雅街道','秀全街道','狮岭镇','炭步镇','花山镇','赤坭镇','梯面镇','花东镇'],
                '番禺区'=>['市桥街道','桥南街道','东环街道','沙头街道','洛浦街道','大石街道','小谷围街道','钟村街道','石壁街道','大龙街道','南村镇','沙湾镇','石碁镇','石楼镇','新造镇','化龙镇'],
                '南沙区'=>['南沙街道','龙穴街道','珠江街道','万顷沙镇','黄阁镇','横沥镇','榄核镇','大岗镇','东涌镇'],
                '增城区'=>['荔城街道','增江街道','朱村街道','永宁街道','中新镇','石滩镇','新塘镇','小楼镇','派潭镇','正果镇','仙村镇'],
                '从化区'=>['街口街道','城郊街道','江埔街道','太平镇','温泉镇','良口镇','吕田镇','鳌头镇']
            ],

            '梅州市'=> [
                '梅江区'=>['金山街道','江南街道','西郊街道','长沙镇','三角镇','城北镇','西阳镇'],
                '梅县区'=>['新城街道','程江镇','南口镇','畲江镇','水车镇','梅南镇','梅西镇','石坑镇','大坪镇','城东镇','石扇镇','白渡镇','丙村镇','雁洋镇','松口镇','隆文镇','桃尧镇','松源镇','扶大镇','梅西水库'],
                '大埔县'=>['湖寮镇','茶阳镇','西河镇','百侯镇','枫朗镇','光德镇','桃源镇 ','高陂镇','大麻镇','三河镇','大东镇','洲瑞镇','银江镇','青溪镇','丰溪林场','洲瑞林场','大埔林场'],
                '丰顺县'=>['埔寨镇','八乡山镇','汤南镇','汤西镇','汤坑镇','北斗镇','建桥镇','丰良镇','龙岗镇','潘田镇','留隍镇','黄金镇','大龙华镇','小胜镇','潭江镇','砂田镇','埔寨农场'],
                '五华县'=>['水寨镇','河东镇','郭田镇','双华镇','棉洋镇','安流镇','梅林镇','龙村镇','横陂镇','华阳镇','周江镇','长布镇','潭下镇','岐岭镇','转水镇','华城镇'],
                '平远县'=>['大柘镇','仁居镇','东石镇','石正镇','八尺镇','差干镇','上举镇','泗水镇','长田镇','热柘镇','中行镇','河头镇'],
                '蕉岭县'=>['蕉城镇','广福镇','文福镇','新铺镇','三圳镇','南礤镇','蓝坊镇','长潭镇','华侨农场'],
                '蕉岭县'=>['兴田街道','福兴街道','宁新街道','龙田','合水','黄陂','黄槐镇','石马镇','永和镇','坭陂镇','新圩镇','水口镇','刁坊镇','新陂镇','叶塘镇','大坪镇','罗岗镇','罗浮镇','宁中镇','径南镇'],
            ],

            '韶关市'=> [
                '武江区'=>['新华街道','惠民街道','西联镇','西河镇','龙归镇','江湾镇','重阳镇'],
                '浈江区'=>['东河街道','车站街道','风采街道','新韶镇','乐园镇','十里亭镇','犁市镇','花坪镇','田螺冲办事处','曲仁办事处'],
                '曲江区'=>['马坝镇','罗坑镇','樟市镇','乌石镇','沙溪镇','大塘镇','小坑镇','枫湾镇','白土镇'],
                '始兴县'=>['太平镇','马市镇','顿岗镇','罗坝镇','城南镇','沈所镇','司前镇','隘子镇','澄江镇','深渡水瑶族乡'],
                '仁化县'=>['丹霞街道','闻韶镇','扶溪镇','长江镇','城口镇','红山镇','石塘镇','董塘镇','大桥镇','周田镇','黄坑镇'],
                '翁源县'=>['龙仙镇','周陂镇','翁城镇','新江镇','江尾镇','坝子镇','官渡镇','铁龙林场'],
                '乳源瑶族自治县'=>['乳城镇','桂头镇','大桥镇','大布镇','洛阳镇','一六镇','必背镇','游溪镇','东坪镇','天井山林场'],
                '新丰县'=>['丰城街道','黄礤镇','马头镇','梅坑镇','沙田镇','遥田镇','回龙镇'],
                '乐昌市'=>['乐城街道','北乡镇','九峰镇','廊田镇','长来镇','梅花镇','三溪镇','坪石镇','黄圃镇','五山镇','两江镇','沙坪镇','云岩镇','秀水镇','大源镇','庆云镇','白石镇','坪石办事处','梅田办事处'],
                '南雄市'=>['雄州街道','东莞大岭山（南雄）产业转移工业园','乌迳镇','界址镇','坪田镇','黄坑镇','邓坊镇','油山镇','南亩镇','水口镇','江头镇','湖口镇','珠玑镇','主田镇','古市镇','全安镇','百顺镇','澜河镇','帽子峰镇']
            ],

            '深圳市'=> [
                '罗湖区'=>['桂园街道','黄贝街道','东门街道','南湖街道','笋岗街道','东湖街道','莲塘街道','东晓街道','清水河街道','翠竹街道'],
                '福田区'=>['园岭街道','南园街道','福田街道','沙头街道','梅林街道','华富街道','香蜜湖街道','莲花街道','华强北街道','福保街道'],
                '南山区'=>['南山街道','南头街道','西丽街道','沙河街道','蛇口街道','招商街道','粤海街道','桃源街道'],
                '宝安区'=>['新安街道','西乡街道','福永街道','沙井街道','松岗街道','石岩街道'],
                '龙华区'=>['观湖街道','民治街道','龙华街道','大浪街道','福城街道','观澜街道'],
                '光明区'=>['光明街道','公明街道','新湖街道','凤凰街道','玉塘街道','马田街道'],
                '龙岗区'=>['龙岗街道','龙城街道','坑梓街道','坪山街道','横岗街道','布吉街道','葵涌街道','大鹏街道','南澳街道','平湖街道','坪地街道','坂田街道','南湾街道'],
                '盐田区'=>['梅沙街道','盐田街道','沙头角街道','海山街道']
            ],

            '珠海市'=> [
                '香洲区'=>['拱北街道','吉大街道','翠香街道','狮山街道','香湾街道','梅华街道','前山街道','湾仔街道','唐家湾镇','南屏镇','横琴镇','桂山镇','万山镇','担杆镇'],
                '斗门区'=>['白藤街道','井岸镇','白蕉镇','斗门镇','乾务镇','莲洲镇'],
                '金湾区'=>['三灶镇','红旗镇','平沙镇','南水镇'],
            ],

            '佛山市'=> [
                '禅城区'=>['祖庙街道','石湾街道','张槎街道','南庄镇'],
                '南海区'=>['桂城街道','里水镇','九江镇','丹灶镇','大沥镇','狮山镇','西樵镇'],
                '顺德区'=>['大良街道','容桂街道','伦教街道','勒流街道','陈村镇','均安镇','杏坛镇','龙江镇','乐从镇','北滘镇'],
                '三水区'=>['西南街道','云东海街道','芦苞镇','大塘镇','乐平镇','白坭镇','南山镇'],
                '高明区'=>['荷城街道','杨和镇','更合镇','明城镇'],
            ],

            '江门市'=> [
                '逢江区'=>['环市街道','潮连街道','北街街道','堤东街道','仓后街道','白沙街道','棠下镇','荷塘镇','杜阮镇'],
                '江海区'=>['外海街道','礼乐街道','江南街道','滘头街道','滘北街道'],
                '新会区'=>['会城街道','大泽镇','司前镇','沙堆镇','古井镇','三江镇','崖门镇','双水镇','罗坑镇','大鳌镇','睦洲镇'],
                '台山市'=>['台城街道','大江镇','水步镇','四九镇','都斛镇','赤溪镇','冲蒌镇','斗山镇','广海镇','川岛镇','端芬镇','海宴镇','汶村镇','三合镇','北陡镇','深井镇','白沙镇'],
                '开平市'=>['三埠街道','长沙街道','月山镇','水口镇','沙塘镇','苍城镇','大沙镇','马冈镇','龙胜镇','赤坎镇','塘口镇','百合镇','蚬冈镇','金鸡镇','赤水镇','翠山湖新区'],
                '鹤山市'=>['沙坪街道','雅瑶镇','龙口镇','古劳镇','桃源镇','共和镇','址山镇','鹤城镇','云乡镇','宅梧镇','双合镇','江门市四堡林场'],
                '恩平市'=>['恩城街道','沙湖镇','大田镇','横陂镇','君堂镇','东成镇','那吉镇','良西镇','牛江镇','大槐镇','圣堂镇'],
            ],

        );







        foreach ($area_datas as $k1 => $v1 )
        {
            $city = City::firstOrCreate(
                ['name' => $k1]
            );

            foreach ($v1 as $k2 => $v2)
            {
                $county = County::firstOrCreate(
                    ['name' => $k2],
                    ['cities_id' => $city->id]
                );

                foreach ($v2 as $v3)
                {
                    $town = Town::firstOrCreate(
                    ['name' => $v3],
                    ['counties_id' => $county->id]
                );
                }

            }

        }
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        DB::table('towns')->truncate();
        DB::table('counties')->truncate();
        DB::table('cities')->truncate();
    }
}
