<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;
use App\Models\City;
use App\Models\County;
use App\Models\Town;

class SeedCitiesAndCountiesAndTownData extends Migration
{





    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        $area_datas = Array(

            '潮州市'=> [
                '湘桥区'=>['凤新街道','湘桥街道','西湖街道','金山街道','太平街道','南春街道','西新街道','桥东街道','城西街道','意溪镇','磷溪镇','官塘镇','铁铺镇'],
                '潮安区'=>['庵埠镇','文祠镇','凤凰镇','江东镇','东凤镇','龙湖镇','彩塘镇','金石镇','浮洋镇','沙溪镇','凤塘镇','古巷镇','登塘镇','赤凤镇','归湖镇','枫溪镇','万峰林场'],
                '饶平县'=>['黄冈镇','钱东镇','海山镇','大埕镇','所城镇','柘林镇','汫洲镇','樟溪镇','浮山镇','汤溪镇','三饶镇','联饶镇','新圩镇','新丰镇','饶洋镇','上饶镇','建饶镇','高堂镇','浮滨镇','新塘镇','东山镇','韩江林场']
            ],

            '揭阳市'=> [
                '榕城区'=>['新兴街道','榕华街道','中山街道','西马街道','东兴街道','榕东街道','仙桥街道','梅云街道','东升街道','东阳街道','渔湖镇','炮台镇','地都镇','登岗镇'],
                '揭东区'=>['曲溪街道','磐东街道','龙尾镇','白塔镇','霖磐镇','桂岭镇','月城镇','玉湖镇','新亨镇','锡场镇','埔田镇','云路镇','玉窖镇','东径茶场','坪上农场','揭阳高新技术产业开发区','卅岭农场','蓝城区工业园区管理处','珠海（揭阳）产业转移工业园'],
                '普宁市'=>['流沙东街道','流沙西街道','流沙南街道','流沙北街道','池尾街道','燎原街道','大南山街道','赤岗镇','大坝镇','洪阳镇','南溪镇','广太镇','麒麟镇','南径镇','占陇镇','军埠镇','下架山镇','高埔镇','云落镇','大坪镇','船埔镇','梅林镇','里湖镇'],
                '揭西县'=>['河婆街道','龙潭镇','南山镇','五经富镇','京溪园镇','灰寨镇','塔头镇','东园镇','凤江镇','棉湖镇','钱坑镇','金和镇','大溪镇','坪上镇','五云镇','上砂镇','良田乡','北山农林场','果林场','油桐林场','高田农场','县苗圃场','河輋农场','梅塘镇','后溪乡','大池农场','马鞍山农场','大坪农场','普侨区','三坑农场','乌石农场','科技工业园','英歌山工业园'],
                '惠来县'=>['惠城镇','隆江镇','葵潭镇','靖海镇','神泉镇','仙庵镇','周田镇','前詹镇','华湖镇','东陇镇','岐石镇','鳌江镇','东港镇','溪西镇','东埔农场','揭阳市大南山华侨管理区','葵潭农场','青坑林场','揭阳（惠来）沿海经济开发试验区','揭阳大南海石化工业区南海']
            ],

            '汕头市'=> [
                '龙湖区'=>['金霞街道','珠池街道','新津街道','鸥汀街道','龙祥街道','外砂镇','新溪镇'],
                '金平区'=>['石炮台街道','金砂街道','金厦街道','东方街道','大华街道','同益街道','光华街道','东墩街道','广厦街道','海安街道','新福街道','乌桥街道','岐山街道','永祥街道','鮀莲街道','鮀江街道','月浦街道'],
                '潮阳区'=>['文光街道','城南街道','棉北街道','金浦街道','海门镇','河溪镇','和平镇','西胪镇','关埠镇','金灶镇','谷饶镇','贵屿镇','铜盂镇'],
                '潮南区'=>['峡山街道','井都镇','陇田镇','雷岭镇','成田镇','红场镇','胪岗镇','两英镇','仙城镇','陈店镇','司马浦镇'],
                '澄海区'=>['凤翔街道','澄华街道','广益街道','东里镇','盐鸿镇','莲华镇','溪南镇','隆都镇','莲上镇','莲下镇','上华镇'],
                '南澳县'=>['后宅镇','云澳镇','深澳镇'],
            ],

            '汕尾市'=> [
                '城区'=>['香洲街道','新港街道','凤山街道','马宫街道','东洲街道','遮浪街道','田墘街道','捷胜镇','红草镇','东涌镇'],
                '陆丰市'=>['东海镇','城东镇','河西镇','甲子镇 ','大安镇','八万镇','陂洋镇','博美镇','南塘镇','甲东镇','湖东镇','碣石镇','金厢镇','潭西镇','桥冲镇','甲西镇','上英镇','西南镇','内湖镇','河东镇','华侨管理区','铜锣湖农场','星都经济开发试验区','大安农场','罗经嶂林场','湖东林场','东海岸林场','红岭林场','畜牧果林场'],
                '海丰县'=>['海城镇','梅陇镇','附城镇','联安镇','陶河镇','可塘镇','赤坑镇','公平镇','城东镇','黄羌镇','平东镇','鹅埠镇','赤石镇','鮜门镇','小漠镇','大湖镇','梅陇农场'],
                '陆河县'=>['河田镇','水唇镇','河口镇','新田镇','上护镇','螺溪镇','东坑镇','南万镇']
            ],

            '广州市'=> [
                '越秀区'=>['洪桥街道','北京街道','六榕街道','流花街道','光塔街道','人民街道','东山街道','农林街道','大东街道','大塘街道','珠光街道','白云街道','建设街道','华乐街道','梅花村街道','黄花岗街道','矿泉街道','登峰街道'],
                '荔湾区'=>['沙面街道','岭南街道','华林街道','多宝街道','昌华街道','逢源街道','龙津街道','金花街道','彩虹街道','南源街道','西村街道','站前街道','桥中街道','白鹤洞街道','冲口街道','花地街道','石围塘街道','茶滘街道','东漖街道','海龙街道','东沙街道','中南街道'],
                '天河区'=>['五山街道','员村街道','车陂街道','沙河街道','石牌街道','兴华街道','沙东街道','林和街道','棠下街道','猎德街道','冼村街道','天园街道','天河南街道','元岗街道','黄村街道','龙洞街道','长兴街道','凤凰街道',' 前进街道','珠吉街道','新塘'],
                '海珠区'=>['赤岗街道','新港街道','昌岗街道','江南中街道','滨江街道','素社街道','海幢街道','南华西街道','龙凤街道','沙园街道','南石头街道','凤阳街道','瑞宝街道','江海街道','琶洲街道','南洲街道','华洲街道','官洲街道'],
                '白云区'=>['三元里街道','松洲街道','景泰街道','黄石街道','同德街道','棠景街道','新市街道','同和街道','京溪街道','永平街道','均禾街道','鹤龙街道','石井街道','金沙街道','白云湖街道','石门街道','云城街道，嘉禾街道','江高镇','人和镇','太和镇','钟落潭镇'],
                '黄埔区'=>['萝岗街道','夏港街道','联和街道','东区街道','永和街道','黄埔街道','红山街道','鱼珠街道','大沙街道','文冲街道','南岗街道','荔联街道','穗东街道','长洲街道','九龙镇'],
                '花都区'=>['花城街道','新华街道','新雅街道','秀全街道','狮岭镇','炭步镇','花山镇','赤坭镇','梯面镇','花东镇'],
                '番禺区'=>['市桥街道','桥南街道','东环街道','沙头街道','洛浦街道','大石街道','小谷围街道','钟村街道','石壁街道','大龙街道','南村镇','沙湾镇','石碁镇','石楼镇','新造镇','化龙镇'],
                '南沙区'=>['南沙街道','龙穴街道','珠江街道','万顷沙镇','黄阁镇','横沥镇','榄核镇','大岗镇','东涌镇'],
                '增城区'=>['荔城街道','增江街道','朱村街道','永宁街道','中新镇','石滩镇','新塘镇','小楼镇','派潭镇','正果镇','仙村镇'],
                '从化区'=>['街口街道','城郊街道','江埔街道','太平镇','温泉镇','良口镇','吕田镇','鳌头镇']

            ],

        );







        foreach ($area_datas as $k1 => $v1 )
        {
            $city = City::firstOrCreate(
                ['name' => $k1]
            );

            foreach ($v1 as $k2 => $v2)
            {
                $county = County::firstOrCreate(
                    ['name' => $k2],
                    ['cities_id' => $city->id]
                );

                foreach ($v2 as $v3)
                {
                    $town = Town::firstOrCreate(
                    ['name' => $v3],
                    ['counties_id' => $county->id]
                );
                }

            }

        }
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        DB::table('towns')->truncate();
        DB::table('counties')->truncate();
        DB::table('cities')->truncate();
    }
}
